'''
Title: Python位运算符
Description: 按位运算符是把数字看作二进制来进行计算的。

@author H.Yang
@email xhaimail@163.com
@date 2020/03/04
'''

a = 60
b = 13
c = 0

# 按位与运算符：参与运算的两个值,如果两个相应位都为1,则该位的结果为1,否则为0
c = a & b 
print("1 - c的值为：",c )

# 按位或运算符：只要对应的二个二进位有一个为1时，结果位就为1。
c = a|b 
print("2 - c的值为", c )

# 按位异或运算符：当两对应的二进位相异时，结果为1
c = a^b
print("3 - c的值为", c )

# 按位取反运算符：对数据的每个二进制位取反,即把1变为0,把0变为1。~x 类似于 -x-1
c = ~a
print("4 - c的值为", c )

# 左移动运算符：运算数的各二进位全部左移若干位，由"<<"右边的数指定移动的位数，高位丢弃，低位补0。
c = a << 2
print("5 - c的值为", c )

# 右移动运算符：把">>"左边的运算数的各二进位全部右移若干位，">>"右边的数指定移动的位数
c = a>> 2
print("6 - c的值为", c )

